package artem.homework;

    /*Составьте программу, выводящую на экран квадраты чисел от 10 до
    20 включительно*/

public class homework3_11 {
    public static void main(String[] args) {
        for (int i = 10; i <= 20 ; i++) {
            int square = i * i;
            System.out.println(square);
        }
    }
}
