package slava_n.lesson3;

public class Conditionals1 {

    public static void main(String[] args) {

        //  Написать программу для вывода названия поры года по номеру
        //месяца

//        int month = 1;
//        switch (month) {
//            case 12:
//            case 1:
//            case 2:
//                System.out.println("Зима");
//                break;
//            case 3:
//            case 4:
//            case 5:
//                System.out.println("Весна");
//                break;
//            case 6:
//            case 7:
//            case 8:
//                System.out.println("Лето");
//                break;
//            case 9:
//            case 10:
//            case 11:
//                System.out.println("Осень");
//                break;
//            default:
//                System.out.println("Введите правильный месяц");
//        }
//    }

        // Напишите программу, которая будет принимать на вход число и на
        //выход будет выводить сообщение четное число или нет.
        //Для определения четности числа используйте операцию получения
        //остатка от деления - операция выглядит так: '% 2').

//    int a = 4;
//        if (a % 2 == 0) {
//        System.out.println("Число четное");
//    } else
//            System.out.println("Число нечетное");
//    }

        // Для введенного числа t (температура на улице) вывести
        //Если t>–5, то вывести «Тепло».
        //Если –5>= t > –20, то вывести «Нормально».
        //Если –20>= t, то вывести «Холодно»

//        int t = -32;
//        if (t > -5) {
//            System.out.println("Тепло");
//        } else if (t <= -5 & t >= -20) {
//            System.out.println("Нормально");
//        } else if (t < -20) {
//            System.out.println("Холодно");
//        } else {
//            System.out.println("Введите корректное значение");
//        }

    }
}
