package slava_n.lesson3;

public class Conditionals2 {
    public static void main(String[] args) {

        //При помощи цикла for вывести на экран нечетные числа от 1 до 99.
        //При решении используйте операцию инкремента (++)

//        for (int i = 0; i <= 99; i++) {
//            if (i % 2 != 0) {
//                System.out.println(i);
//            }
//        }

        //Необходимо вывести на экран числа от 5 до 1.
        //При решении используйте операцию декремента (--)

//        for (int i = 5; i >= 1; i--) {
//            System.out.println(i);
//        }

        //Необходимо, чтоб программа выводила на экран вот такую
        //последовательность:
        //7 14 21 28 35 42 49 56 63 70 77 84 91 98.
        //В решении используйте цикл while.

//        int i = 7;
//        while (i <= 98) {
//            System.out.println(i);
//            i += 7;
//        }

    }
}
