package NikitaVecherski.lesson9;

//Задача 2: Конструкция try-catch-finally
//Описание: Напишите метод, который делит два числа. Используйте конструкцию try-catch-finally, чтобы обработать возможные ошибки.
//
//Задание:
//
//Если делитель равен нулю, выбрасывайте ArithmeticException.
//В блоке finally выводите сообщение о завершении операции.
//В методе main протестируйте метод с различными значениями.


public class Task2 {

    public static void main(String[] args) {
        System.out.println("Введите по очереди два числа, которые хотите поделить");
    Logic logic = new Logic();
    }

}
